renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
/*********************************************************************************************************//**
 * @file    uart_module.c
 * @version $Rev:: 1292         $
 * @date    $Date:: 2024-08-01 #$
 * @brief   The UART Module (interrupt mode with buffer).
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "uart_module.h"
#include "common/ring_buffer.h"

/* Private types -------------------------------------------------------------------------------------------*/
typedef struct
{
  HT_USART_TypeDef *pUARTx;
  u8 uFIFOMode;
  u8 uIsTxFinished;
} UARTModule_StateTypeDef;

/* Private constants ---------------------------------------------------------------------------------------*/
#ifdef HTCFG_UARTM_CH0
#define _TX0_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM0_TX_GPIO_PORT)
#define _TX0_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM0_TX_GPIO_PIN)
#define _RX0_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM0_RX_GPIO_PORT)
#define _RX0_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM0_RX_GPIO_PIN)
#define _RX0_GPIO_CLK             STRCAT2(P,         HTCFG_UARTM0_RX_GPIO_PORT)
#define _RX0_GPIO_PORT            STRCAT2(HT_GPIO,   HTCFG_UARTM0_RX_GPIO_PORT)
#define _RX0_GPIO_PIN             STRCAT2(GPIO_PIN_, HTCFG_UARTM0_RX_GPIO_PIN)
#define _UART_CH0                 STRCAT2(HT_,       HTCFG_UARTM_CH0)
#define _UART_INT0                STRCAT2(HTCFG_UARTM_CH0, _IRQn)
#endif

#ifdef HTCFG_UARTM_CH1
#define _TX1_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM1_TX_GPIO_PORT)
#define _TX1_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM1_TX_GPIO_PIN)
#define _RX1_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM1_RX_GPIO_PORT)
#define _RX1_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM1_RX_GPIO_PIN)
#define _RX1_GPIO_CLK             STRCAT2(P,         HTCFG_UARTM1_RX_GPIO_PORT)
#define _RX1_GPIO_PORT            STRCAT2(HT_GPIO,   HTCFG_UARTM1_RX_GPIO_PORT)
#define _RX1_GPIO_PIN             STRCAT2(GPIO_PIN_, HTCFG_UARTM1_RX_GPIO_PIN)
#define _UART_CH1                 STRCAT2(HT_,       HTCFG_UARTM_CH1)
#define _UART_INT1                STRCAT2(HTCFG_UARTM_CH1, _IRQn)
#endif

#ifdef HTCFG_UARTM_CH2
#define _TX2_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM2_TX_GPIO_PORT)
#define _TX2_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM2_TX_GPIO_PIN)
#define _RX2_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM2_RX_GPIO_PORT)
#define _RX2_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM2_RX_GPIO_PIN)
#define _RX2_GPIO_CLK             STRCAT2(P,         HTCFG_UARTM2_RX_GPIO_PORT)
#define _RX2_GPIO_PORT            STRCAT2(HT_GPIO,   HTCFG_UARTM2_RX_GPIO_PORT)
#define _RX2_GPIO_PIN             STRCAT2(GPIO_PIN_, HTCFG_UARTM2_RX_GPIO_PIN)
#define _UART_CH2                 STRCAT2(HT_,       HTCFG_UARTM_CH2)
#define _UART_INT2                STRCAT2(HTCFG_UARTM_CH2, _IRQn)
#endif

#ifdef HTCFG_UARTM_CH3
#define _TX3_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM3_TX_GPIO_PORT)
#define _TX3_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM3_TX_GPIO_PIN)
#define _RX3_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM3_RX_GPIO_PORT)
#define _RX3_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM3_RX_GPIO_PIN)
#define _RX3_GPIO_CLK             STRCAT2(P,         HTCFG_UARTM3_RX_GPIO_PORT)
#define _RX3_GPIO_PORT            STRCAT2(HT_GPIO,   HTCFG_UARTM3_RX_GPIO_PORT)
#define _RX3_GPIO_PIN             STRCAT2(GPIO_PIN_, HTCFG_UARTM3_RX_GPIO_PIN)
#define _UART_CH3                 STRCAT2(HT_,       HTCFG_UARTM_CH3)
#define _UART_INT3                STRCAT2(HTCFG_UARTM_CH3, _IRQn)
#endif

#ifdef HTCFG_UARTM_CH4
#define _TX4_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM4_TX_GPIO_PORT)
#define _TX4_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM4_TX_GPIO_PIN)
#define _RX4_GPIO_ID              STRCAT2(GPIO_P,    HTCFG_UARTM4_RX_GPIO_PORT)
#define _RX4_AFIO_PIN             STRCAT2(AFIO_PIN_, HTCFG_UARTM4_RX_GPIO_PIN)
#define _RX4_GPIO_CLK             STRCAT2(P,         HTCFG_UARTM4_RX_GPIO_PORT)
#define _RX4_GPIO_PORT            STRCAT2(HT_GPIO,   HTCFG_UARTM4_RX_GPIO_PORT)
#define _RX4_GPIO_PIN             STRCAT2(GPIO_PIN_, HTCFG_UARTM4_RX_GPIO_PIN)
#define _UART_CH4                 STRCAT2(HT_,       HTCFG_UARTM_CH4)
#define _UART_INT4                STRCAT2(HTCFG_UARTM_CH4, _IRQn)
#endif

#define UART_MODULE_SUPPORT_CH                (5)

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _UARTM_IRQHandler(u32 CH);

/* Private macro -------------------------------------------------------------------------------------------*/
#define __DBG_Printf(...)

#if (UART_MODULE_DEBUG_MODE == 1)
  #undef __DBG_Printf
  #define __DBG_Printf printf
  #warning "================================ Debug Mode Warning ===================================="
  #warning " Debug mode has been enable which degrade the performance.                              "
  #warning " After all debug operation is finished, please remember to turn off debug mode.         "
  #warning "========================================================================================"
#endif

