renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
/* Global variables ----------------------------------------------------------------------------------------*/
Buffer_TypeDef gUART_Tx[UART_MODULE_SUPPORT_CH];
Buffer_TypeDef gUART_Rx[UART_MODULE_SUPPORT_CH];
__ALIGN4 u8 guUART_TxBuffer[UART_MODULE_SUPPORT_CH][HTCFG_UARTM0_TX_BUFFER_SIZE];
__ALIGN4 u8 guUART_RxBuffer[UART_MODULE_SUPPORT_CH][HTCFG_UARTM0_RX_BUFFER_SIZE];

#if FREERTOS_UART
SemaphoreHandle_t Semphr[UART_MODULE_SUPPORT_CH];
StaticSemaphore_t Semphr_Buffer[UART_MODULE_SUPPORT_CH];
SemaphoreHandle_t Mutex_TX[UART_MODULE_SUPPORT_CH];
SemaphoreHandle_t Mutex_RX[UART_MODULE_SUPPORT_CH];
StaticSemaphore_t Mutex_TX_Buffer[UART_MODULE_SUPPORT_CH];
StaticSemaphore_t Mutex_RX_Buffer[UART_MODULE_SUPPORT_CH];
u32 Transfer_Result[UART_MODULE_SUPPORT_CH];
#endif

/* Private variables ---------------------------------------------------------------------------------------*/
static UARTModule_StateTypeDef gUARTModuleState[UART_MODULE_SUPPORT_CH];

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  UART Module init function.
  * @param  CH
  * @param  pUART_Init
  * @param  uRxTimeOutValue
  * @retval None
  ***********************************************************************************************************/
void UARTM_Init(u32 CH, USART_InitTypeDef *pUART_Init, u32 uRxTimeOutValue)
{
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  #if (AUTO_CK_CONTROL == 0)
  CKCUClock.Bit.AFIO       = 1;
  #endif

  #ifdef HTCFG_UARTM_CH0
  if (CH == UARTM_CH0)
  {
    gUARTModuleState[CH].pUARTx = _UART_CH0;
    Buffer_Init(&gUART_Tx[CH], guUART_TxBuffer[CH], HTCFG_UARTM0_TX_BUFFER_SIZE);
    Buffer_Init(&gUART_Rx[CH], guUART_RxBuffer[CH], HTCFG_UARTM0_RX_BUFFER_SIZE);

    /* Enable UART & AFIO APB clock                                                                         */
    CKCUClock.Bit.HTCFG_UARTM_CH0 = 1;
    CKCUClock.Bit._RX0_GPIO_CLK = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Turn on UxART Rx internal pull up resistor to prevent unknow state                                   */
    GPIO_PullResistorConfig(_RX0_GPIO_PORT, _RX0_GPIO_PIN, GPIO_PR_UP);

    /* Configure AFIO as UART mode                                                                          */
    AFIO_GPxConfig(_TX0_GPIO_ID, _TX0_AFIO_PIN, AFIO_FUN_USART_UART);
    AFIO_GPxConfig(_RX0_GPIO_ID, _RX0_AFIO_PIN, AFIO_FUN_USART_UART);

    NVIC_EnableIRQ(_UART_INT0);

    #ifdef HT_USART0
    if ((_UART_CH0 == HT_USART0)
        #ifdef LIBCFG_USART1
        || (_UART_CH0 == HT_USART1)
        #endif
       )
    {
      USART_RXTLConfig(_UART_CH0, UART_MODULE_FIFO_LEVEL);
      USART_SetTimeOutValue(_UART_CH0, uRxTimeOutValue);
      USART_IntConfig(_UART_CH0, USART_INT_TOUT, ENABLE);
      gUARTModuleState[CH].uFIFOMode = 1;
    }
    #endif
  }
  #endif

  #ifdef HTCFG_UARTM_CH1
  if (CH == UARTM_CH1)
  {
    gUARTModuleState[CH].pUARTx = _UART_CH1;
    Buffer_Init(&gUART_Tx[CH], guUART_TxBuffer[CH], HTCFG_UARTM1_TX_BUFFER_SIZE);
    Buffer_Init(&gUART_Rx[CH], guUART_RxBuffer[CH], HTCFG_UARTM1_RX_BUFFER_SIZE);

    /* Enable UART & AFIO APB clock                                                                         */
    CKCUClock.Bit.HTCFG_UARTM_CH1 = 1;
    CKCUClock.Bit._RX1_GPIO_CLK = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Turn on UxART Rx internal pull up resistor to prevent unknow state                                   */
    GPIO_PullResistorConfig(_RX1_GPIO_PORT, _RX1_GPIO_PIN, GPIO_PR_UP);

    /* Configure AFIO as UART mode                                                                          */
    AFIO_GPxConfig(_TX1_GPIO_ID, _TX1_AFIO_PIN, AFIO_FUN_USART_UART);
    AFIO_GPxConfig(_RX1_GPIO_ID, _RX1_AFIO_PIN, AFIO_FUN_USART_UART);

    NVIC_EnableIRQ(_UART_INT1);

    #ifdef HT_USART0
    if ((_UART_CH1 == HT_USART0)
        #ifdef LIBCFG_USART1
        || (_UART_CH1 == HT_USART1)
        #endif
       )
    {
      USART_RXTLConfig(_UART_CH1, UART_MODULE_FIFO_LEVEL);
      USART_SetTimeOutValue(_UART_CH1, uRxTimeOutValue);
      USART_IntConfig(_UART_CH1, USART_INT_TOUT, ENABLE);
      gUARTModuleState[CH].uFIFOMode = 1;
    }
    #endif
  }
  #endif

  #ifdef HTCFG_UARTM_CH2
  if (CH == UARTM_CH2)
  {
    gUARTModuleState[CH].pUARTx = _UART_CH2;
    Buffer_Init(&gUART_Tx[CH], guUART_TxBuffer[CH], HTCFG_UARTM2_TX_BUFFER_SIZE);
    Buffer_Init(&gUART_Rx[CH], guUART_RxBuffer[CH], HTCFG_UARTM2_RX_BUFFER_SIZE);

    /* Enable UART & AFIO APB clock                                                                         */
    CKCUClock.Bit.HTCFG_UARTM_CH2 = 1;
    CKCUClock.Bit._RX2_GPIO_CLK = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Turn on UxART Rx internal pull up resistor to prevent unknow state                                   */
    GPIO_PullResistorConfig(_RX2_GPIO_PORT, _RX2_GPIO_PIN, GPIO_PR_UP);

    /* Configure AFIO as UART mode                                                                          */
    AFIO_GPxConfig(_TX2_GPIO_ID, _TX2_AFIO_PIN, AFIO_FUN_USART_UART);
    AFIO_GPxConfig(_RX2_GPIO_ID, _RX2_AFIO_PIN, AFIO_FUN_USART_UART);

    NVIC_EnableIRQ(_UART_INT2);

    #ifdef HT_USART0
    if ((_UART_CH2 == HT_USART0)
        #ifdef LIBCFG_USART1
        || (_UART_CH2 == HT_USART1)
        #endif
       )
    {
      USART_RXTLConfig(_UART_CH2, UART_MODULE_FIFO_LEVEL);
      USART_SetTimeOutValue(_UART_CH2, uRxTimeOutValue);
      USART_IntConfig(_UART_CH2, USART_INT_TOUT, ENABLE);
      gUARTModuleState[CH].uFIFOMode = 1;
    }
    #endif
  }
  #endif

  #ifdef HTCFG_UARTM_CH3
  if (CH == UARTM_CH3)
  {
    gUARTModuleState[CH].pUARTx = _UART_CH3;
    Buffer_Init(&gUART_Tx[CH], guUART_TxBuffer[CH], HTCFG_UARTM3_TX_BUFFER_SIZE);
    Buffer_Init(&gUART_Rx[CH], guUART_RxBuffer[CH], HTCFG_UARTM3_RX_BUFFER_SIZE);

    /* Enable UART & AFIO APB clock                                                                         */
    CKCUClock.Bit.HTCFG_UARTM_CH3 = 1;
    CKCUClock.Bit._RX3_GPIO_CLK = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

