renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
    /* Turn on UxART Rx internal pull up resistor to prevent unknow state                                   */
    GPIO_PullResistorConfig(_RX3_GPIO_PORT, _RX3_GPIO_PIN, GPIO_PR_UP);

    /* Configure AFIO as UART mode                                                                          */
    AFIO_GPxConfig(_TX3_GPIO_ID, _TX3_AFIO_PIN, AFIO_FUN_USART_UART);
    AFIO_GPxConfig(_RX3_GPIO_ID, _RX3_AFIO_PIN, AFIO_FUN_USART_UART);

    NVIC_EnableIRQ(_UART_INT3);

    #ifdef HT_USART0
    if ((_UART_CH3 == HT_USART0)
        #ifdef LIBCFG_USART1
        || (_UART_CH3 == HT_USART1)
        #endif
       )
    {
      USART_RXTLConfig(_UART_CH3, UART_MODULE_FIFO_LEVEL);
      USART_SetTimeOutValue(_UART_CH3, uRxTimeOutValue);
      USART_IntConfig(_UART_CH3, USART_INT_TOUT, ENABLE);
      gUARTModuleState[CH].uFIFOMode = 1;
    }
    #endif
  }
  #endif

  #ifdef HTCFG_UARTM_CH4
  if (CH == UARTM_CH4)
  {
    gUARTModuleState[CH].pUARTx = _UART_CH4;
    Buffer_Init(&gUART_Tx[CH], guUART_TxBuffer[CH], HTCFG_UARTM4_TX_BUFFER_SIZE);
    Buffer_Init(&gUART_Rx[CH], guUART_RxBuffer[CH], HTCFG_UARTM4_RX_BUFFER_SIZE);

    /* Enable UART & AFIO APB clock                                                                         */
    CKCUClock.Bit.HTCFG_UARTM_CH4 = 1;
    CKCUClock.Bit._RX4_GPIO_CLK = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Turn on UxART Rx internal pull up resistor to prevent unknow state                                   */
    GPIO_PullResistorConfig(_RX4_GPIO_PORT, _RX4_GPIO_PIN, GPIO_PR_UP);

    /* Configure AFIO as UART mode                                                                          */
    AFIO_GPxConfig(_TX4_GPIO_ID, _TX4_AFIO_PIN, AFIO_FUN_USART_UART);
    AFIO_GPxConfig(_RX4_GPIO_ID, _RX4_AFIO_PIN, AFIO_FUN_USART_UART);

    NVIC_EnableIRQ(_UART_INT4);

    #ifdef HT_USART0
    if ((_UART_CH4 == HT_USART0)
        #ifdef LIBCFG_USART1
        || (_UART_CH4 == HT_USART1)
        #endif
       )
    {
      USART_RXTLConfig(_UART_CH4, UART_MODULE_FIFO_LEVEL);
      USART_SetTimeOutValue(_UART_CH4, uRxTimeOutValue);
      USART_IntConfig(_UART_CH4, USART_INT_TOUT, ENABLE);
      gUARTModuleState[CH].uFIFOMode = 1;
    }
    #endif
  }
  #endif

  USART_Init(gUARTModuleState[CH].pUARTx, pUART_Init);
  USART_TxCmd(gUARTModuleState[CH].pUARTx, ENABLE);
  USART_RxCmd(gUARTModuleState[CH].pUARTx, ENABLE);
  #if defined(USART_INT_OE)
  USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_RXDR | USART_INT_OE, ENABLE);
  #else
  USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_RXDR, ENABLE);
  #endif
}

/*********************************************************************************************************//**
  * @brief  UART module write byte (Tx).
  * @param  CH
  * @param  uData
  * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
u32 UARTM_WriteByte(u32 CH, u8 uData)
{
  u32 uResult;
  uResult = Buffer_WriteByte(&gUART_Tx[CH], uData);
  if (uResult == TRUE)
  {
    gUARTModuleState[CH].uIsTxFinished = FALSE;
    #if (LIBCFG_USART_V01)
    USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_TXDE, ENABLE);
    #else
    USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_TXDE | USART_INT_TXC, ENABLE);
    #endif
  }

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  UART module write (Tx).
  * @param  CH
  * @param  pBuffer
  * @param  uLength
  * @retval success write count
  ***********************************************************************************************************/
u32 UARTM_Write(u32 CH, u8 *pBuffer, u32 uLength)
{
  u32 uResult;
  u32 uFreeSpace = gUART_Tx[CH].uSize - Buffer_GetLength(&gUART_Tx[CH]);
  if (uLength > uFreeSpace)
  {
    return 0;
  }
  uResult = Buffer_Write(&gUART_Tx[CH], pBuffer, uLength);
  if (uResult > 0)
  {
    gUARTModuleState[CH].uIsTxFinished = FALSE;
    #if (LIBCFG_USART_V01)
    USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_TXDE, ENABLE);
    #else
    USART_IntConfig(gUARTModuleState[CH].pUARTx, USART_INT_TXDE | USART_INT_TXC, ENABLE);
    #endif
  }

  return uResult;
}

/*********************************************************************************************************//**
  * @brief  UART module read byte (Rx).
  * @param  CH
  * @param  pData
  * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
u32 UARTM_ReadByte(u32 CH, u8 *pData)
{
  return (Buffer_ReadByte(&gUART_Rx[CH], pData));
}

/*********************************************************************************************************//**
  * @brief  UART module read (Rx).
  * @param  CH
  * @param  pBuffer
  * @param  uLength
  * @retval Read count
  ***********************************************************************************************************/
u32 UARTM_Read(u32 CH, u8 *pBuffer, u32 uLength)
{
  return (Buffer_Read(&gUART_Rx[CH], pBuffer, uLength));
}

/*********************************************************************************************************//**
  * @brief  Get Read buffer length (Rx).
  * @param  CH
  * @retval uLength
  ***********************************************************************************************************/
u32 UARTM_GetReadBufferLength(u32 CH)
{
  return (Buffer_GetLength(&gUART_Rx[CH]));
}

/*********************************************************************************************************//**
  * @brief  Get Write buffer length (Tx).
  * @param  CH
  * @retval uLength
  ***********************************************************************************************************/
u32 UARTM_GetWriteBufferLength(u32 CH)
{
  return (Buffer_GetLength(&gUART_Tx[CH]));
}

/*********************************************************************************************************//**
  * @brief  Get Tx Status.
  * @param  CH
  * @retval TRUE for TX is Finished, FALSE for TX is not Finished
  ***********************************************************************************************************/
u8 UARTM_IsTxFinished(u32 CH)
{
  return (gUARTModuleState[CH].uIsTxFinished);
}

