renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
/*********************************************************************************************************//**
  * @brief  Discard Read buffer.
  * @param  CH
  * @retval None
  ***********************************************************************************************************/
void UARTM_DiscardReadBuffer(u32 CH)
{
  Buffer_Discard(&gUART_Rx[CH]);
}

#if defined(UART0_IRQ_HANDLER) || defined(UART1_IRQ_HANDLER) || defined(UART2_IRQ_HANDLER) || defined(UART3_IRQ_HANDLER) || defined(UART4_IRQ_HANDLER) || defined(USART0_IRQ_HANDLER) || defined(USART1_IRQ_HANDLER) || defined(USART2_IRQ_HANDLER)
#if defined(HT_USART0) && defined(USART0_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void USART0_IRQHandler(void)
{
  USART0_IRQ_HANDLER();
}
#endif
#if defined(HT_USART1) && defined(USART1_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void USART1_IRQHandler(void)
{
  USART1_IRQ_HANDLER();
}
#endif
#if defined(HT_USART2) && defined(USART2_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void USART2_IRQHandler(void)
{
  USART2_IRQ_HANDLER();
}
#endif
#if defined(USE_HT32F52357_67)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART0_UART2_IRQHandler(void)
{
  #if defined(HT_UART0) && defined(UART0_IRQ_HANDLER)
  UART0_IRQ_HANDLER();
  #endif
  #if defined(HT_UART2) && defined(UART2_IRQ_HANDLER)
  UART2_IRQ_HANDLER();
  #endif
}
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART1_UART3_IRQHandler(void)
{
  #if defined(HT_UART1) && defined(UART1_IRQ_HANDLER)
  UART1_IRQ_HANDLER();
  #endif
  #if defined(HT_UART3) && defined(UART3_IRQ_HANDLER)
  UART3_IRQ_HANDLER();
  #endif
}
#else
#if defined(HT_UART0) && defined(UART0_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART0_IRQHandler(void)
{
  UART0_IRQ_HANDLER();
}
#endif
#if defined(HT_UART1) && defined(UART1_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART1_IRQHandler(void)
{
  UART1_IRQ_HANDLER();
}
#endif
#if defined(HT_UART2) && defined(UART2_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART2_IRQHandler(void)
{
  UART2_IRQ_HANDLER();
}
#endif
#if defined(HT_UART3) && defined(UART3_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART3_IRQHandler(void)
{
  UART3_IRQ_HANDLER();
}
#endif
#if defined(HT_UART4) && defined(UART4_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UART4_IRQHandler(void)
{
  UART4_IRQ_HANDLER();
}
#endif
#endif
#else
#ifdef HTCFG_UARTM_CH0
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UARTM_CH0_IRQHandler(void)
{
  _UARTM_IRQHandler(UARTM_CH0);
}
#endif

#ifdef HTCFG_UARTM_CH1
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UARTM_CH1_IRQHandler(void)
{
  _UARTM_IRQHandler(UARTM_CH1);
}
#endif

#ifdef HTCFG_UARTM_CH2
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UARTM_CH2_IRQHandler(void)
{
  _UARTM_IRQHandler(UARTM_CH2);
}
#endif

#ifdef HTCFG_UARTM_CH3
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UARTM_CH3_IRQHandler(void)
{
  _UARTM_IRQHandler(UARTM_CH3);
}
#endif

