renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
#ifdef HTCFG_UARTM_CH4
/*********************************************************************************************************//**
 * @brief   This function handles UART interrupt.
 * @retval  None
 ************************************************************************************************************/
void UARTM_CH4_IRQHandler(void)
{
  _UARTM_IRQHandler(UARTM_CH4);
}
#endif
#endif

/*********************************************************************************************************//**
  * @brief  This function handles UART interrupt.
  * @param  CH
  * @retval None
  ***********************************************************************************************************/
static void _UARTM_IRQHandler(u32 CH)
{
  u8 uTempData;
  s32 i;
  UARTModule_StateTypeDef *pUARTMState = &gUARTModuleState[CH];
  if (pUARTMState->pUARTx == 0)
  {
    return;
  }
#if LIBCFG_USART_V01
  if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_RLSI))
  {
    if (pUARTMState->pUARTx->SR & USART_LSR_OE)
    {
      __DBG_Printf("Rx Over Run!\n\r");
      while (1);
    }
  }
#else
  if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_OE))
  {
    __DBG_Printf("Rx Over Run!\n\r");
    while (1);
  }
#endif
  if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_TXDE))
  {
    if (Buffer_isEmpty(&gUART_Tx[CH]))
    {
      USART_IntConfig(pUARTMState->pUARTx, USART_INT_TXDE, DISABLE);
    }
    else
    {
      if (pUARTMState->uFIFOMode == 1)
      {
        for (i = 6; i != 0; i--)
        {
          Buffer_ReadByte(&gUART_Tx[CH], &uTempData);
          pUARTMState->pUARTx->DR = uTempData;
          if (Buffer_isEmpty(&gUART_Tx[CH]))
          {
            break;
          }
        }
      }
      else
      {
        Buffer_ReadByte(&gUART_Tx[CH], &uTempData);
        pUARTMState->pUARTx->DR = uTempData;
      }
    }
  }

  if (pUARTMState->uFIFOMode == 0)
  {
    /*------------------------------------------------------------------------------------------------------*/
    /* Move data from UART FIFO to buffer when Rx FIFO level reached                                        */
    /*------------------------------------------------------------------------------------------------------*/
    if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_RXDR))
    {
      #if (UART_MODULE_DEBUG_MODE == 1)
      if (Buffer_isFull(&gUART_Rx[CH]))
      {
        /*--------------------------------------------------------------------------------------------------*/
        /* Should not reach here! It means the buffer for USART is full.                                    */
        /*--------------------------------------------------------------------------------------------------*/
        __DBG_Printf("UART Rx Buffer Full!\n\r");
        while (1);
      }
      #endif
      Buffer_WriteByte(&gUART_Rx[CH], (pUARTMState->pUARTx->DR & (u32)0x000000FF));
    }
  }
  else
  {
    /*------------------------------------------------------------------------------------------------------*/
    /* Move data from USART FIFO to buffer when Rx timeout                                                  */
    /*------------------------------------------------------------------------------------------------------*/
    if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_TOUT))
    {
      #ifndef LIBCFG_USART_V01
      USART_ClearFlag(pUARTMState->pUARTx, USART_FLAG_TOUT);
      #endif
      while (USART_GetFIFOStatus(pUARTMState->pUARTx, USART_FIFO_RX))
      {
        #if (UART_MODULE_DEBUG_MODE == 1)
        if (Buffer_isFull(&gUART_Rx[CH]))
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Should not reach here! It means the buffer for USART is full.                                  */
          /*------------------------------------------------------------------------------------------------*/
          __DBG_Printf("UART Rx Buffer Full!\n\r");
          while (1);
        }
        #endif
        Buffer_WriteByte(&gUART_Rx[CH], (pUARTMState->pUARTx->DR & (u32)0x000000FF));
      }
    }

    /*------------------------------------------------------------------------------------------------------*/
    /* Move data from USART FIFO to buffer when Rx FIFO level reached                                       */
    /*------------------------------------------------------------------------------------------------------*/
    if (USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_RXDR))
    {
      while (USART_GetFIFOStatus(pUARTMState->pUARTx, USART_FIFO_RX))
      {
        #if (UART_MODULE_DEBUG_MODE == 1)
        if (Buffer_isFull(&gUART_Rx[CH]))
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Should not reach here! It means the buffer for USART is full.                                  */
          /*------------------------------------------------------------------------------------------------*/
          __DBG_Printf("UART Rx Buffer Full!\n\r");
          while (1);
        }
        #endif
        Buffer_WriteByte(&gUART_Rx[CH], (pUARTMState->pUARTx->DR & (u32)0x000000FF));
      }
    }
  }

  #if (LIBCFG_USART_V01)
  // Did not supptor TXC interrupt.
  // Use "while (USART_GetFlagStatus(HTCFG_UART_PORT, USART_FLAG_TXC) == RESET);" instead.
  #else
  if (USART_GetIntStatus(pUARTMState->pUARTx, USART_INT_TXC) &&
      USART_GetFlagStatus(pUARTMState->pUARTx, USART_FLAG_TXC))
  {
    USART_IntConfig(pUARTMState->pUARTx, USART_INT_TXC, DISABLE);
    pUARTMState->uIsTxFinished = TRUE;

    #if FREERTOS_UART
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    #endif
  }
  #endif
}

#if FREERTOS_UART
void UARTM_Init_FreeRTOS(u32 CH, USART_InitTypeDef *pUART_Init, u32 uRxTimeOutValue)
{
  taskENTER_CRITICAL();
  UARTM_Init(CH, pUART_Init, uRxTimeOutValue);
  Semphr[CH] = xSemaphoreCreateBinaryStatic(&Semphr_Buffer[CH]);
  Mutex_TX[CH] = xSemaphoreCreateMutexStatic(&Mutex_TX_Buffer[CH]);
  Mutex_RX[CH] = xSemaphoreCreateMutexStatic(&Mutex_RX_Buffer[CH]);
  taskEXIT_CRITICAL();
}

u32 UARTM_WriteByte_FreeRTOS(u32 CH, u8 uData, u32 Timeout)
{
  TimeOut_t Tick_Base;

