renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/uart_module.c
  vTaskSetTimeOutState(&Tick_Base);

  if (xSemaphoreTake(Mutex_TX[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  UARTM_WriteByte(CH, uData);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if (xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE )
  {
    xSemaphoreGive(Mutex_TX[CH]);
    return FALSE;
  }

  if (xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex_TX[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex_TX[CH]);

  return Transfer_Result[CH];
}

u32 UARTM_Write_FreeRTOS(u32 CH, u8 *pBuffer, u32 uLength, u32 Timeout)
{
  TimeOut_t Tick_Base;

  vTaskSetTimeOutState(&Tick_Base);

  if (xSemaphoreTake(Mutex_TX[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  UARTM_Write(CH, pBuffer, uLength);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if (xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE )
  {
    xSemaphoreGive(Mutex_TX[CH]);
    return FALSE;
  }

  if (xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex_TX[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex_TX[CH]);

  return Transfer_Result[CH];
}

u32 UARTM_ReadByte_FreeRTOS(u32 CH, u8 *pData, u32 Timeout)
{
  u32 uResult = FALSE;

  if (xSemaphoreTake(Mutex_RX[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  uResult = UARTM_ReadByte(CH, pData);

  xSemaphoreGive(Mutex_RX[CH]);

  return uResult;
}

u32 UARTM_Read_FreeRTOS(u32 CH, u8 *pBuffer, u32 uLength, u32 Timeout)
{
  u32 uResult = 0;

  if (xSemaphoreTake(Mutex_RX[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  uResult = UARTM_Read(CH, pBuffer, uLength);

  xSemaphoreGive(Mutex_RX[CH]);

  return uResult;
}


u32 UARTM_DiscardReadBuffer_FreeRTOS(u32 CH, u32 Timeout)
{
  if (xSemaphoreTake(Mutex_RX[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  UARTM_DiscardReadBuffer(CH);
  xSemaphoreGive(Mutex_RX[CH]);

  return TRUE;
}
#endif
